[
    {
        "title": "The Shawshank Redemption",
        "rank": "1",
        "id": "tt0111161",
        "description" : "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency. Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit."
    },
    {
        "title": "The Godfather",
        "rank": "2",
        "id": "tt0068646",
        "description" : "An aging dynastic leader of a crime organization, transfers control of the underground kingdom to his reluctant son."
    },
    {
        "title": "The Godfather: Part II",
        "rank": "3",
        "id": "tt0071562",
        "description":"Michael, son of Vito Corleone, seeks to continue to expand his family's 'kingdom'. Despite having reached a business deal with Hyman Roth, the gangster, he is unaware of the danger that awaits him."
    },
    {
        "title": "Pulp Fiction",
        "rank": "4",
        "id": "tt0110912",
        "description":"In the underworld criminal, a series of incidents eventually connects the lives of two Los Angeles mobsters, the wife of a gangster, a boxer and two petty criminals."
    },
    {
        "title": "The Good, the Bad and the Ugly",
        "rank": "5",
        "id": "tt0060196",
        "description":"During the American Civil War, three hunters try to finish off Tuco Ramirez and steal a hoard of gold."
    },
    {
        "title": "The Dark Knight",
        "rank": "6",
        "id": "tt0468569",
        "description":"Batman has a new enemy, the Joker, a criminal mastermind whose ambition is to destroy Gotham City. Along with Gordon and Harvey Dent, Batman must fight to stop it before it's too late."
    },
    {
        "title": "12 Angry Men",
        "rank": "7",
        "id": "tt0050083",
        "description":"Tells the story of a jury of 12 as they consider the sentence or release of an 18-year-old defendant on the basis of reasonable doubt, which forces jurors to question their morals and values."
    },
    {
        "title": "Schindler's List",
        "rank": "8",
        "id": "tt0108052",
        "description":"Set in Poland during World War II, Oskar Schindler becomes increasingly concerned about the safety of his Jewish-born workforce after witnessing Nazi persecution."
    },
    {
        "title": "The Lord of the Rings: The Return of the King",
        "rank": "9",
        "id": "tt0167260",
        "description":"The former Fraternity guards the Ring preparing for the final battle. As Frodo & Sam head to Mount Doom to destroy the Ring, they follow Gollum unaware of where they are being led."
    },
    {
        "title": "Fight Club",
        "rank": "10",
        "id": "tt0137523",
        "description":"Having trouble sleeping and bored with his routine, an office worker forms a forbidden fight club with his partner. However, things turned out of control and very dangerous."
    },
    {
        "title": "Star Wars: Episode V - The Empire Strikes Back",
        "rank": "11",
        "id": "tt0080684",
        "description":"After the rebels are crushed by Imperial forces, Darth Vader returns for revenge and seeks to draw Luke Skywalker to the side of evil. However, Master Yoda did not remain silent."
    },
    {
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "rank": "12",
        "id": "tt0120737",
        "description":"Frodo, the young hobbit, inherits a ring of evil powers belonging to Sauron, the Lord of Darkness. Now, he must embark on a long, dangerous journey to Mount Doom to destroy it."
    },
    {
        "title": "One Flew Over the Cuckoo's Nest",
        "rank": "13",
        "id": "tt0073486",
        "description":"In September 1963, Randle Patrick McMurphy was sentenced to prison on charges of assaulting and raping a 15-year-old woman. He was transferred to a mental hospital to have his mental state evaluated. As the law applies, a person whose soul is disturbed will not get a prison sentence."
    },
    {
        "title": "Inception",
        "rank": "14",
        "id": "tt1375666",
        "description":"Cobb, an expert spy, steals information from his targets by entering into their dreams. He is wanted for the murder of his wife, and the only way to atone for all of this, is with Inception."
    },
    {
        "title": "Goodfellas",
        "rank": "15",
        "id": "tt0099685",
        "description":"From a true story, the plot revolves around Henry and his two unstable friends Jimmy and Tommy, as they gradually climb the various ladders of petty crime to murder."
    },
    {
        "title": "Star Wars",
        "rank": "16",
        "id": "tt0076759",
        "description":"Princess Leia was kidnapped by Darth Vader. Now, only Luke Skywalker, Han Solo and the rebel alliance troops can save him from the clutches of the Empire."
    },
    {
        "title": "Seven Samurai",
        "rank": "17",
        "id": "tt0047478",
        "description":"A village of farmers who hire seven ronin to fight bandits who will return soon after the farmers harvest their crops to rob them of the farmers."
    },
    {
        "title": "Forrest Gump",
        "rank": "18",
        "id": "tt0109830",
        "description":"Forrest Gump, a man with a low IQ - but kind, joins the army to serve. However, his mind couldn't seem to stop thinking about his childhood sweetheart, Jenny Curran."
    },
    {
        "title": "The Matrix",
        "rank": "19",
        "id": "tt0133093",
        "description":"Thomas, a computer programmer and evil hacker, is led to fight an underground war against the powerful computers that now rule the world with a system called 'The Matrix'."
    },
    {
        "title": "The Lord of the Rings: The Two Towers",
        "rank": "20",
        "id": "tt0167261",
        "description":"Frodo and Sam travel to Mordor on a mission to destroy the Ring. Meanwhile, unexpectedly by Gandalf, Saruman allied himself with Sauron and built an army of orcs on Isengard."
    }
]